УчетВУправляющихДляГит1/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовЕГАИС</name>
  <enumValues>
    <name>АктТТН</name>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОФорматеОбмена</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийОтказ</name>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМОтменаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ФорматыОбменаЕГАИС/ФорматыОбменаЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыОбменаЕГАИС</name>
  <enumValues>
    <name>V1</name>
  </enumValues>
  <enumValues>
    <name>V2</name>
  </enumValues>
  <enumValues>
    <name>V3</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/ВидыДокументовЕГАИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает префикс переданного пространства имен.
//
Функция ПрефиксПространстваИмен(ПространствоИмен) Экспорт
	
	Если ВРег(ПространствоИмен) = ВРег("http://www.w3.org/2001/XMLSchema-instance") Тогда
		Возврат "xsi";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://www.w3.org/2001/XMLSchema") Тогда
		Возврат "xs";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActInventoryABInfo")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActInventoryF1F2Info") Тогда
		Возврат "iab";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ProductRef")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ProductRef_v2") Тогда
		Возврат "pref";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ClientRef")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ClientRef_v2") Тогда
		Возврат "oref";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/WB_DOC_SINGLE_01") Тогда
		Возврат "ns";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle_v2")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActTTNSingle_v3") Тогда
		Возврат "wa";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActChargeOn")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActChargeOn_v2")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActChargeOnShop_v2") Тогда
		Возврат "ainp";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff_v2")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOff_v3")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActUnFixBarCode")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActFixBarCode")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ActWriteOffShop_v2") Тогда
		Возврат "awr";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryParameters")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RequestRepealWB")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RequestRepealACO")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/RequestRepealAWO")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/InfoVersionTTN") Тогда
		Возврат "qp";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryFormAB")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryFormF1F2") Тогда
		Возврат "qf";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ConfirmTicket")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/ConfirmRepealWB") Тогда
		Возврат "wt";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle_v2")
		ИЛИ ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TTNSingle_v3") Тогда
		Возврат "wb";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TransferToShop") Тогда
		Возврат "tts";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/TransferFromShop") Тогда
		Возврат "tfs";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryBarcode") Тогда
		Возврат "bk";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/QueryFilter") Тогда
		Возврат "remove";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/CommonV3") Тогда
		Возврат "ce";
		
	ИначеЕсли ВРег(ПространствоИмен) = ВРег("http://fsrar.ru/WEGAIS/CommonEnum") Тогда
		Возврат "unqualified_element";
		
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Возвращает адрес исходящего запроса для выгрузки документа в УТМ.
//
Функция АдресЗапроса(ВидДокумента, ФорматОбмена) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМ
		Или ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМОтменаПередачи Тогда
		Возврат "/xml";
	КонецЕсли;
	
	РезультатПоиска = НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена);
	Если РезультатПоиска = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = РезультатПоиска.ТипЕГАИС;
	Если ЗначениеЗаполнено(РезультатПоиска.URLДокумента) Тогда
		Значение = РезультатПоиска.URLДокумента;
	КонецЕсли;
	
	Возврат "/opt/in/" + Значение;
	
КонецФункции

// Возвращает пространство имен для документа ЕГАИС.
//
Функция ПространствоИмен(ВидДокумента, ФорматОбмена) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМ
		Или ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМОтменаПередачи Тогда
		Возврат "egaischeque.joint.2";
	КонецЕсли;
	
	РезультатПоиска = НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена);
	Если РезультатПоиска = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = РезультатПоиска.ТипЕГАИС;
	Если ЗначениеЗаполнено(РезультатПоиска.ПространствоИмен) Тогда
		Значение = РезультатПоиска.ПространствоИмен;
	КонецЕсли;
	
	Возврат "http://fsrar.ru/WEGAIS/" + Значение;
	
КонецФункции

// Возвращает пространство имен для документа ЕГАИС.
//
Функция ТипЕГАИС(ВидДокумента, ФорматОбмена) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМ
		Или ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМОтменаПередачи Тогда
		Возврат "Cheque";
	КонецЕсли;
	
	РезультатПоиска = НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена);
	Если РезультатПоиска = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Значение = РезультатПоиска.ТипЕГАИС;
	
	Возврат Значение;
	
КонецФункции

// Возвращает вид документа и версию формата обмена по строковому типу ЕГАИС.
//
// Параметры:
//  ТипЕГАИС - Строка - Тип ЕГАИС.
//  ТаблицаСоответствияДокументовТипамЕГАИС - ТаблицаЗначений - см. функцию Перечисления.ВидыДокументовЕГАИС.ТаблицаСоответствияДокументовТипамЕГАИС().
//
Функция ДанныеДокументаПоТипуЕГАИС(ТипЕГАИС, ТаблицаСоответствияДокументовТипамЕГАИС = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ВидДокументаЕГАИС");
	ВозвращаемоеЗначение.Вставить("ФорматОбмена");
	
	РезультатПоиска = Неопределено;
	
	Если ТаблицаСоответствияДокументовТипамЕГАИС = Неопределено Тогда
		ТаблицаСоответствия = ТаблицаСоответствияДокументовТипамЕГАИС();
	Иначе
		ТаблицаСоответствия = ТаблицаСоответствияДокументовТипамЕГАИС;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ТаблицаСоответствия Цикл
		Если ВРег(СтрокаТЧ.ТипЕГАИС) = ВРег(ТипЕГАИС) Тогда
			РезультатПоиска = СтрокаТЧ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатПоиска <> Неопределено Тогда
		ВозвращаемоеЗначение.ВидДокументаЕГАИС = РезультатПоиска.ВидДокументаЕГАИС;
		ВозвращаемоеЗначение.ФорматОбмена      = РезультатПоиска.ФорматОбмена;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредыдущаяВерсияФорматаОбмена(ФорматОбмена)
	
	Если ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.V2;
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.V1;
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1 Тогда
		Возврат Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	ИначеЕсли ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НайтиСтрокуТаблицыСоответствия(ВидДокумента, ФорматОбмена)
	
	ТаблицаСоответствия = ТаблицаСоответствияДокументовТипамЕГАИС();
	
	ТекущийФорматОбмена = ФорматОбмена;
	
	Пока Истина Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ВидДокументаЕГАИС", ВидДокумента);
		ПараметрыОтбора.Вставить("ФорматОбмена",      ТекущийФорматОбмена);
		
		РезультатПоиска = ТаблицаСоответствия.НайтиСтроки(ПараметрыОтбора);
		
		Если РезультатПоиска.Количество() <> 0 Тогда
			Возврат РезультатПоиска[0];
		Иначе
			ТекущийФорматОбмена = ПредыдущаяВерсияФорматаОбмена(ТекущийФорматОбмена);
		КонецЕсли;
		
		Если ТекущийФорматОбмена = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Возвращает таблицу соответствия вида документа и версии формата строковому типу ЕГАИС.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с колонками:
//   * ТипЕГАИС - Строка - Строковый тип ЕГАИС.
//   * ВидДокументаЕГАИС - ПеречислениеСсылка.ВидыДокументовЕГАИС - Операция.
//   * ФорматОбмена - ПеречислениеСсылка.ФорматыОбменаЕГАИС - Формат обмена.
//
Функция ТаблицаСоответствияДокументовТипамЕГАИС() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТипЕГАИС",          Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("URLДокумента",      Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ПространствоИмен",  Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ВидДокументаЕГАИС", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДокументовЕГАИС"));
	Таблица.Колонки.Добавить("ФорматОбмена",      Новый ОписаниеТипов("ПеречислениеСсылка.ФорматыОбменаЕГАИС"));
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	
	
	// Производные типы WayBillAct
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle";
	// Производные типы WayBillAct
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v2");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	
	
	// Производные типы WayBillAct_v2
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v2");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v2");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v2");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v2";
	// Производные типы WayBillAct_v2
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v3");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТН;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	
	
	// Производные типы WayBillAct_v3
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v3");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНОтказ;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v3");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНПодтверждение;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBillAct_v3");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктТТНРасхождения;
	НоваяСтрока.ПространствоИмен = "ActTTNSingle_v3";
	// Производные типы WayBillAct_v3
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActChargeOn");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActChargeOn_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActChargeOnShop_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActFixBarCode");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВРегистр3;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActWriteOff");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActWriteOff_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActWriteOff_v3");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActWriteOffShop_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActUnFixBarCode");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзРегистра3;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("TransferFromShop");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ВозвратИзРегистра2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("RequestRepealACO");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("RequestRepealAWO");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросНаОтменуПроведенияАктаСписания;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("RequestRepealWB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросНаОтменуПроведенияТТН;
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ConfirmRepealWB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.КвитанцияЗапросаНаОтменуПроведенияТТН;
	
	// Производные типы ConfirmRepealWB
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ConfirmRepealWB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.КвитанцияЗапросаНаОтменуПроведенияТТНОтказ;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ConfirmRepealWB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение;
	// Производные типы ConfirmRepealWB
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryAP");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросАлкогольнойПродукции;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryAP_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросАлкогольнойПродукции;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryClients");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросДанныхОрганизации;
	НоваяСтрока.URLДокумента      = "QueryPartner";
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryClients_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросДанныхОрганизации;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryRests");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryRests_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryRestsShop_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОстатковВРегистре2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryFormA");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросСправки1;
	НоваяСтрока.ПространствоИмен  = "QueryFormAB";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryFormF1");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросСправки1;
	НоваяСтрока.ПространствоИмен  = "QueryFormF1F2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryFormB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросСправки2;
	НоваяСтрока.ПространствоИмен  = "QueryFormAB";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryFormF2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросСправки2;
	НоваяСтрока.ПространствоИмен  = "QueryFormF1F2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryResendDoc");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросТТН;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("InfoVersionTTN");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ИнформацияОФорматеОбмена;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("Ticket");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.Квитанция;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyAP");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросАлкогольнойПродукции;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyAP_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросАлкогольнойПродукции;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyClient");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросДанныхОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyClient_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросДанныхОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRests");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОстатковВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRests_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОстатковВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRestsShop_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОстатковВРегистре2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRestsShop_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОстатковВРегистре2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("TransferToShop");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ПередачаВРегистр2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ConfirmTicket");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.КвитанцияАктаРасхождений;
	
	
	// Производные типы ConfirmTicket
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ConfirmTicket");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.КвитанцияАктаРасхожденийОтказ;
	НоваяСтрока.URLДокумента = "WayBillTicket";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ConfirmTicket");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка();
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.КвитанцияАктаРасхожденийПодтверждение;
	НоваяСтрока.URLДокумента = "WayBillTicket";
	// Производные типы ConfirmTicket
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("TTNInformBReg");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.УведомлениеОРегистрацииДвиженияТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("TTNInformF2Reg");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.УведомлениеОРегистрацииДвиженияТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActInventoryInformBReg");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ActInventoryInformF2Reg");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyFormA");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросСправки1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyForm1");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросСправки1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyFormB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросСправки2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyForm2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросСправки2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBill");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBill_v2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle_v2";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("WayBill_v3");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ТТН;
	НоваяСтрока.ПространствоИмен  = "TTNSingle_v3";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryHistoryRestShop");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаДвиженияМеждуРегистрами;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyHistoryShop");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаДвиженияМеждуРегистрами;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryRests_Mini");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаОстаткиВРегистре1;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRests_Mini");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаОстаткиВРегистре1;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryRestsShop_Mini");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаОстаткиВРегистре2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRestsShop_Mini");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаОстаткиВРегистре2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryWriteOffCheque");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаОбработанныеЧеки;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyWriteOffCheque");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаОбработанныеЧеки;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryNATTN");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаНеобработанныеТТН;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyNoAnswerTTN");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаНеобработанныеТТН;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryClientVersion");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаИнформацияОбОрганизации;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyClientVersion");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаИнформацияОбОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryFormBHistory");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаДвиженияПоСправке2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyHistFormB");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V1;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаДвиженияПоСправке2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryForm2History");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаДвиженияПоСправке2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyHistForm2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаДвиженияПоСправке2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryBarcode");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросАкцизныхМарок;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyBarcode");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросАкцизныхМарок;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryParentHistForm2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаИсторияСправок2;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyParentHistForm2");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаИсторияСправок2;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryRestBCode");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросОтчетаОстаткиВРегистре3;
	НоваяСтрока.ПространствоИмен  = "QueryParameters";
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyRestBCode");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросОтчетаОстаткиВРегистре3;
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("TTNHistoryF2Reg");
	НоваяСтрока.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V2;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ИсторияСправок2ПоТТН;
	
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("QueryFilter");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации;
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ТипЕГАИС = ("ReplyFilter");
	НоваяСтрока.ФорматОбмена      = Перечисления.ФорматыОбменаЕГАИС.V3;
	НоваяСтрока.ВидДокументаЕГАИС = Перечисления.ВидыДокументовЕГАИС.ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации;
	
	Возврат Таблица;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.ВидыДокументовЕГАИС.АктТТН);
	Результат.Добавить(Перечисления.ВидыДокументовЕГАИС.КвитанцияЗапросаНаОтменуПроведенияТТН);
	Результат.Добавить(Перечисления.ВидыДокументовЕГАИС.Квитанция);
	Результат.Добавить(Перечисления.ВидыДокументовЕГАИС.КвитанцияАктаРасхождений);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
